git add --all *
git commit -m 'Производитель или потребитель? Кто из них ты? — Matt G. Paradise; По терминологии. Империя и ымперия / В защиту Империи от Ымперии (добавлено) — Джагг; Маркс против русской революции (конспект) — С.Г. Кара-Мурза; Rats FAQ 3в: Клетки: погрызание таковых (11.10.2016); Понимание ЛаВея в XXI веке, лекция LV-SB:03, Разыскивается бог — живым или мертвым (19.10.2016); Добавил 6 картинок в раздел "Атеизм" [29]'
git reflog expire --expire=now --all
git gc --force --aggressive --prune=now
git repack -a -d
git push --force